Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: །ཀུན་དགའ་བོ་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་སྐྱེད་མོས་ཚལ་འདིར་ཞུགས་པ་ན་དེ་ལྟ་བུའི་དགེ་བའི་སེམས་སྐྱེས་པ་ཡང་འདས་པའི་དུས་སུ་དེ་བཞིན་གཤེགས་པ་རྣམས་སྐྱེད་མོས་ཚལ་འདིར་བཞུགས་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་མདོ་སྡེ་འདི་གསུངས་པས་ན་དེའི་ཕྱིར་སྐྱེད་མོས་ཚལ་འདིའི་ཡོན་ཏན་ཇི་སྙེད་ཡོད་པ་དེ་དག་ནི་གཞན་དག་དང་ཐུན་མོང་དུ་མ་གྱུར་པས་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་གུས་པས་ཕྱག་བྱེད་པ་ཡིན་ནོ།
en: “Ānanda, when King Bimbisāra entered this forest, he had such virtuous thoughts. In the past, thus-gone ones resided in this forest and taught this discourse of the Bodhisattva Collection. Therefore, none of the qualities associated with this forest are found in other places, and all the worlds with their gods, humans, and demigods are respectfully paying homage to it.

source: །ཀུན་དགའ་བོ་སྐྱེད་མོས་ཚལ་འདི་ན་ནི་སྦྲུལ་གདུག་པ་དང་། རྩངས་པ་དང་། སྦྲང་བུ་དང་། སྦྲང་བུ་མཆུ་རིངས་ལ་སོགས་པ་མེད་དོ།
en: Ānanda, in this forest, there are no poisonous snakes, lizards, horseflies, mosquitos, or the like.

source: །གལ་ཏེ་གནས་པར་གྱུར་ན་ཡང་གདུག་པའི་སེམས་མེད་དོ།
en: Beings who reside here do not entertain any evil thoughts:

source: །འདི་ཡང་འོད་མའི་ཚལ་གྱི་ཐུན་མོང་མ་ཡིན་པའི་ཡོན་ཏན་ཡིན་ཏེ།
en: this is also an extraordinary quality of Veṇuvana.

source: གལ་ཏེ་ལོ་བརྒྱའི་བར་དུ་ཚལ་འདིའི་ཡོན་ཏན་བརྗོད་ན་ཡང་མཐར་ཐུག་པར་མི་འགྱུར་རོ།
en: Even if I attempted to express the qualities of this grove for one hundred years, this task would never come to an end.

source: ཀུན་དགའ་བོ་འོད་མའི་ཚལ་གྱི་དྲི་གཙང་ཁང་འདི་ནི་ཡོན་ཏན་ཚད་མེད་པ་སྙེད་དང་ལྡན་གྱི་གཞན་ནི་དེ་ལྟ་མ་ཡིན་པས་སོ།
en: Because, Ānanda, this perfumed chamber of Veṇuvana possesses all those immeasurable qualities, while other places do not.”

source: །བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་སྔོན་འོད་མའི་ཚལ་འདི་འདི་ལྟ་བུའི་ཡོན་ཏན་དང་ལྡན་པར་མ་འཚལ་ལགས་སོ།
en: “Blessed One,” said the venerable Ānanda, “I did not know that Veṇuvana possessed such qualities!

source: །བཅོམ་ལྡན་འདས་བདག་གིས་སྔར་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་བགྱི་བར་མ་མོས་པའི་སྡིག་པ་གང་ལགས་པ་དེང་བདག་བཤགས་པར་འཚལ་ལོ།
en: Blessed One, I want to confess today my previous negative attitude of not wanting to serve the Blessed One as his attendant.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་དང་པོ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པ་ཐོབ་པར་གྱུར་པ་དེ་ཉིད་ཀྱི་ཚེ་སྡིག་པ་དེ་དག་བྱང་བར་གྱུར་ཏོ།
en: “Ānanda,” replied the Blessed One, “that negative attitude was purified the very moment you attained the pure eye of Dharma with respect to phenomena.”

source: །རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱི་ལེའུ་སྟེ་ལྔ་པའོ།། །།བམ་པོ་ལྔ་པ།
en: This was the fifth chapter, The Power of Miraculous Displays.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འདི་སྙམ་དུ་བཅོམ་ལྡན་འདས་ནི་འདི་ལྟར་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམས་ལེགས་པར་སྟོན་པར་མཛད་པས་བཅོམ་ལྡན་འདས་ནི་ཤིན་ཏུ་ངོ་མཚར་ཆེ་བ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Then the venerable Mahāmaudgalyāyana thought, “The Blessed One has perfectly taught the conduct of bodhisattvas through his great compassion. The Blessed One is therefore quite astonishing! Why?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཕུན་སུམ་ཚོགས་པར་སྒྲུབ་ཅིང་སྐྱེ་འགག་མེད་པའི་དོན་སེམས་ཅན་གྱིས་ཁོང་དུ་ཆུད་པར་བྱེད་པས་སོ་སྙམ་མོ།
en: Because bodhisattvas will practice the Dharma of the Buddha in the most excellent manner and will cause sentient beings to comprehend the meaning of the absence of arising and ceasing.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་སེམས་ཀྱི་བསམ་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། མཽད་གལ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ནོ།
en: At that moment, the Blessed One knew the thought that had arisen in the mind of the venerable Mahāmaudgalyāyana and he said, “Thus it is, Maudgalyāyana, thus it is! The thus-gone ones indeed possess great compassion.

source: །གལ་ཏེ་ངའི་ཉན་ཐོས་གང་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་དོན་ཐོས་པར་གྱུར་ན་སེམས་མྱོ་མྱོ་པོར་འགྱུར་ཞིང་མོས་པར་ཡང་མི་འགྱུར་རོ།
en: If my hearers heard about such great compassion, they would become perplexed and lose their inspiration.

source: །མཽད་གལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་ལྟ་རེ་ཤིག་ཞོག་གི །ངས་གལ་ཏེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་སྙིང་རྗེ་ཆེན་པོ་ཇི་སྙེད་ཅིག་དང་ལྡན་པ་ཡོངས་སུ་རྫོགས་པར་བརྗོད་པར་གྱུར་ན་ཡང་ཁྱོད་ཀྱི་སེམས་མྱོ་མྱོ་པོར་འགྱུར་ཞིང་མོས་པར་ཡང་མི་འགྱུར་རོ།
en: Maudgalyāyana, you would become perplexed and lose your inspiration if I were now so much as to describe fully how much compassion I had in the past when I was practicing bodhisattva conduct, let alone speak of the great compassion of the thus-gone ones.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ལེགས་སོ། །བཅོམ་ལྡན་འདས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཇི་ལྟ་བུ་མངའ་བ་ལས་ཕྱོགས་ཅུང་ཟད་ཅིག་བཤད་དུ་གསོལ།
en: “Very well, Blessed One,” said the venerable Mahāmaudgalyāyana, “but please do tell us at least just a little about your great compassion as you practiced bodhisattva conduct in the past.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ཁྱོད་ལ་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་སྙིང་རྗེ་ཆེན་པོ་ལས་ཕྱོགས་ཅུང་ཟད་ཅིག་དཔེས་བསྟན་པར་བྱའོ།
en: “Maudgalyāyana,” continued the Blessed One, “listen carefully and keep my words in mind. I shall explain a little to you of my great compassion when I practiced bodhisattva conduct in the past, with some examples of it.

source: །སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྙིང་རྗེ་ཆེན་པོ་ཇི་སྙེད་ཅིག་སྤྱད་པ་བརྗོད་ཀྱིས་མི་ལང་མོད་ཀྱི།
en: The extent of the great compassion I had when I was practicing bodhisattva conduct in the past would be impossible to express, indeed;

source: སྙིང་རྗེ་ཆེན་པོ་དེ་ནི་དངོས་པོ་རྣམ་པ་བཞི་ལ་གནས་པར་འགྱུར་རོ།
en: but that great compassion was based on four attitudes.

source: །བཞི་གང་ཞེ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཇི་ཙམ་དུ་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པ་དེ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་མངོན་པར་བསྒྲུབས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་སྙིང་རྗེ་ཆེན་པོ་ཞེས་བྱའོ།
en: What were those four attitudes? The point about the great compassion of bodhisattvas is this: it is the extent to which they abide by great compassion that determines the extent to which bodhisattvas accomplish the Dharma of the Buddha; that is what is called great compassion.

source: །མཽད་གལ་ང་ནི་སྔོན་སེམས་ཅན་རྣམས་ལ་འདི་ལྟ་བུའི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན། འདི་ལྟ་བུའི་སྨོན་ལམ་ཆེན་པོ་དང་ལྡན་པས་སེམས་ཅན་ཇི་སྙེད་ཅིག་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པ་ན་སྡུག་བསྔལ་རྣམས་མྱོང་བར་གྱུར་པ་དང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཐིག་ནག་དང་། བསྡུས་འཇོམས་དང་། ཡང་སོས་དང་། ངུ་འབོད་དང་། ངུ་འབོད་ཆེན་པོ་དང་། ཚ་བ་དང་། རབ་ཏུ་ཚ་བ་དག་ན་སྡུག་བསྔལ་མྱོང་བར་གྱུར་པ་དག་ལ་ཡང་ངས་རྟག་ཏུ་སེམས་ཅན་དེ་དག་གི་ཆེད་དུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ན་སྡུག་བསྔལ་ཇི་སྙེད་ཡོད་པ་དག་སྡིག་པའི་ལས་མ་བྱང་བ་དེ་སྲིད་དུ་སྡུག་བསྔལ་རྣམས་མྱོང་བར་གྱུར་ཀྱང་སེམས་ལ་འགྱོད་པ་མེད་པར་གྱུར་ཏོ།
en: “Maudgalyāyana, in the past, because of the great compassion of that kind that I had for sentient beings, and the great aspirations of that kind that I made for them, however many beings were suffering within the great Hell of Ceaseless Torment, the great Black Line Hell, Crushing Hell, Reviving Hell, Wailing Hell, Great Wailing Hell, Hot Hell, and Extremely Hot Hell, for the sake of each of them I always experienced whatever sufferings they were experiencing in those great hells for as long as their negative karma was not purified, without feeling any discouragement.

source: །མཽད་གལ་གལ་ཏེ་སེམས་ཅན་གྱི་དོན་དུ་འགྱུར་བའི་རྒྱུ་དང་རྐྱེན་ཅིག་ཡོད་པར་གྱུར་ན་ངས་དེ་དག་ཐམས་ཅད་དང་དུ་བླངས་ནས་སེམས་ཅན་དེ་དག་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ལས་ཐར་བར་བྱས་ནས་ང་ཉིད་སྡུག་བསྔལ་དང་དུ་ལེན་པར་བྱེད་པས་སེམས་ཅན་གཅིག་གི་དམྱལ་བའི་སྡུག་བསྔལ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་སྡིག་པའི་ལས་མཐར་ཐུག་པའི་བར་དུ་དང་དུ་བླངས་ཀྱང་དེའི་ཚེ་ངའི་སེམས་ལ་འགྱོད་པ་ཅི་ཡང་མེད་དོ། །
en: “Maudgalyāyana, if there were any causes and conditions to bring about for the benefit of sentient beings, I would readily undertake all of them and liberate those sentient beings from the great hells. I would readily take upon myself the hellish suffering of every single sentient being until all of them had purified their negative karma, and during that time I never felt any discouragement.

source: མཽད་གལ་ངས་ནི་འདི་ལྟ་བུའི་སྨོན་ལམ་དང་བརྩོན་འགྲུས་ཆེན་པོ་བསྐྱེད་ནས་བློ་དང་ལྡན་པ་འདི་ལྟ་སྟེ། སངས་རྒྱས་དང་། དེའི་ཉན་ཐོས་དག་ལ་འདི་ལྟར་རིགས་པའི་ཚུལ་དྲི་བའི་རྒྱུ་དང་རྐྱེན་ཡོད་པར་གྱུར་ན་སྡུག་བསྔལ་དང་དུ་བླངས་ནས་སེམས་ཅན་རྣམས་སེམས་ཅན་དམྱལ་བ་ལས་ཐར་བར་བྱེད་པས་མཽད་གལ་མཁས་པ་དག་གིས་ཐོས་པར་གྱུར་ན་ངའི་མང་དུ་ཐོས་པའི་བསྔགས་པ་བརྗོད་དེ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ་སྦྱིན་པ་གཏོང་བར་བྱེད། ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད། བཟོད་པ་སྒོམ་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ་པར་བྱེད། དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པའི་བསྔགས་པ་རྗོད་པར་བྱེད་དོ།
en: Maudgalyāyana, after giving rise to such an aspiration and such great diligence, I asked the wise ones, such as the buddhas and their hearers, ‘Might such appropriate causes and conditions as these suffice to take on suffering and liberate beings from the hells?’ Maudgalyāyana, when the wise heard this, they praised me for my erudition—they praised the fact that I had given rise to the mind set on awakening and was then practicing generosity, guarding my discipline, cultivating patience, engendering diligence, and attending virtuous friends.

source: །མཽད་གལ་ངས་དེ་ལྟ་བུ་ཐོས་ནས་བརྩོན་འགྲུས་ཆེན་པོ་བསྐྱེད་དེ་ཆོས་ཡོངས་སུ་གཉེར་བའི་ཕྱིར་ལྷག་པའི་བསམ་པ་བསྐྱེད་ནས་སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་ཕུན་སུམ་ཚོགས་པ་ཆེན་པོ་ཐོབ་པར་བྱ་བའི་ཆེད་དུ་བརྩོན་འགྲུས་བརྩམས་སོ།
en: Maudgalyāyana, when I heard this, I gave rise to the extraordinary resolve of pursuing the Dharma with great diligence. I cultivated diligence in order to receive the sublime, excellent Dharma of the Buddha.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཕུན་སུམ་ཚོགས་པར་བྱ་བའི་ཆེད་དུ་བཟོད་པ་ཡོངས་སུ་བསྒོམས་སོ།
en: I cultivated patience in order to master the perfections.

source: །མཽད་གལ་ངས་སྔོན་ཇི་ལྟར་བཟོད་པ་ཡོངས་སུ་བསྒོམས་ཤེ་ན།
en: “Maudgalyāyana, how did I cultivate patience?

source: སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་འདི་ལྟར་སེམས་བསྐྱེད་དེ།
en: In the past, when I was a bodhisattva, I gave rise to this mindset:

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་ཡོད་པའི་སེམས་ཅན་ཇི་སྙེད་པ་གཟུགས་ཅན་ནམ། གཟུགས་མེད་པའམ། འདུ་ཤེས་ཅན་ནམ། འདུ་ཤེས་མེད་པའམ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་ཡང་རུང་སྟེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་མ་ལུས་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ནས་ཐམས་ཅད་བདག་གི་དྲུང་དུ་འོངས་ཏེ། འདི་སྐད་དུ་ཀྱེ་ཁྱོད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཡིན་ལ། བདག་ཅག་ནི་འདོད་པ་ལྔའི་བདེ་བ་དང་། འཚོ་བའི་ཡོ་བྱད་ཀྱིས་མང་དུ་ཕོངས་པ་ཡིན་ཏེ།
en: ‘Suppose all the sentient beings living in the universes of the ten directions—whether they have form or not, whether they have perception or not, and whether they have neither perception nor nonperception—were to obtain a human life form, come to me, and say, “You have given rise to the mind set on unsurpassed and perfect awakening, yet we lack a great many sense pleasures as well as basic necessities.

source: ཁྱོད་གལ་ཏེ་བདག་ཅག་ལ་སྦྱིན་པར་མི་ནུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་མི་འགྱུར་རོ་ཞེས་སེམས་ཅན་དེ་དག་གིས་དེའི་ཚེ་ཚིག་བརླང་པོས་བརྒྱད་བཀག་གམ།
en: If you cannot provide these things to us, you will never attain unsurpassed and perfect awakening!”

source: མི་བདེན་པས་སྐྱོན་སྨོས་སམ། ཡིད་དང་མི་འཐུན་པའི་ཕྱིར་རལ་གྲི་དང་། དབྱུག་པ་དང་། གྱོ་མོ་དག་གིས་བདག་གི་ལུས་ལ་གནོད་པ་བྱས་ཀྱང་བདག་དེའི་ཚེ་ཞེ་སྡང་དང་འགྱོད་པ་མི་བསྐྱེད་པར་བདག་གིས་འདི་ལྟར་སེམས་རབ་ཏུ་གདུལ་བར་བྱའོ།
en: “ ‘Even if those beings were to rebuke me with harsh words, criticize me with untrue accusations, or, out of hostility, harm me physically with swords, sticks, and stones, I will then never be angry or regretful.

source: །སེམས་ཅན་འདི་དག་ནི་གླེན་ཞིང་གཏི་མུག་པ་དང་། ཤེས་པ་མེད་པས་གཏི་མུག་གི་ལས་བྱེད་པ་ཡིན་ན།
en: Instead I will tame my mind, thinking, “Those beings are deluded, ignorant, and devoid of insight, so they commit deluded actions.

source: གལ་ཏེ་བདག་གིས་ཀྱང་སེམས་ཅན་གླེན་ཞིང་གཏི་མུག་པ་འདི་དག་ལ་ཞེ་སྡང་དང་། འཁོན་དུ་འཛིན་པ་བསྐྱེད་པར་གྱུར་ན། འོ་ན་ནི་བདག་འདི་དག་དང་ཐ་དད་པ་ཡང་ཅི་ཡོད།
en: This being so, if I were to become angry and resentful toward those deluded and ignorant beings, how would I be different from them?

source: འདི་དག་ནི་ལམ་དུ་མ་ཞུགས་པ་ཡིན་ལ། བདག་ནི་དགེ་བའི་ལམ་དུ་ཞུགས་པ་ཡིན་པས་དེང་བདག་གིས་སེམས་ཅན་འདི་དག་ལས་སྡུག་བསྔལ་དང་དུ་བླངས་ཏེ་ཞེ་སྡང་གི་བསམ་པ་མི་བསྐྱེད་པར་ས་ཆེན་པོ་བཞིན་དུ་བཟང་པོ་དང་ངན་པ་ཤོང་བར་བྱའོ་སྙམ་ནས། མཽད་གལ་ངས་སྔོན་བཟོད་པ་འདི་ལྟ་བུ་ཡོངས་སུ་བསྒོམས་སོ།
en: They have not yet entered the virtuous path, but I have, so I should now earnestly take their sufferings upon myself. Without giving rise to any thought of anger, I should accommodate both the good and the bad, just like the earth does.” ’ It was with that mindset, Maudgalyāyana, that in the past I cultivated patience.

source: །གཞན་ཡང་མཽད་གལ་ངས་ནི་ཡུན་རིང་པོ་ནས་རྟག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ལ་བུ་གཅིག་པ་བཞིན་དུ་བལྟས་སོ།
en: “Furthermore, Maudgalyāyana, for a long time I have constantly perceived all sentient beings as if they were my only child.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ཁྱིམ་བདག་ཤིན་དུ་ཕྱུག་ཅིང་ནོར་མང་ལ་རིན་པོ་ཆེ་རབ་ཏུ་མང་བ། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་ལྡན་པ་ཞིག་ཡོད་ལ།
en: Take the example of a rich, wealthy, and affluent householder surrounded by male and female servants, as well as other staff.

source: དེ་བརྟུལ་ཞུགས་རྣམ་པ་བརྒྱ་སྤྱད་དེ་བུ་ཞིག་རྙེད་པར་གྱུར་ནས་སེམས་ལ་སྡུག་ཅིང་བལྟ་བས་མི་ངོམས་པར་གྱུར་ན།
en: After performing hundreds of rituals, he becomes the father of a son. His son is very dear to him, so he never tires of looking at his son.

source: མཽད་གལ་ཁྱིམ་བདག་དེ་ནི་རྟག་པར་བུ་དེའི་ལེགས་པའི་དངོས་པོ་ཚོལ་བར་བྱེད།
en: Maudgalyāyana, that householder always looks for the best circumstances for his son.

source: རྟག་པར་ལེགས་པའི་དངོས་པོ་སྦྱིན་པར་བྱེད། རྟག་པར་ཕན་པ་སྦྱིན་པར་བྱེད་ཀྱི། གནོད་པ་དང་ཕན་པ་མ་ཡིན་པ་སྦྱིན་པར་མི་བྱེད་དོ།
en: He always provides him with the best things as well as his support, and he never gives him anything that would harm him or disadvantage him.

source: །དེ་བཞིན་མཽད་གལ་ང་ཡང་ཡུན་རིང་པོ་ནས་རྟག་པར་སེམས་ཅན་རྣམས་ལ་བུ་གཅིག་པ་བཞིན་དུ་ལྟ་བར་བྱེད་པས་ངས་ཡུན་རིང་པོ་ནས་རྟག་པར་སེམས་ཅན་རྣམས་ལ་ལེགས་པའི་དངོས་པོ་ཡོངས་སུ་བཙལ་ནས་ཕན་འདོགས་པར་བྱེད་ཀྱི།
en: Similarly, Maudgalyāyana, for a long time I have constantly perceived all sentient beings as if they were my only child. Thus, for a long time I have constantly looked after what is best for them and supported them.

source: གནོད་པ་དང་ཕན་པ་མ་ཡིན་པ་སྦྱིན་པར་མི་བྱེད་དོ།
en: On the other hand, I have never given them anything that would harm or disadvantage them.

source: །མཽད་གལ་ངས་ནི་ཡུན་རིང་པོ་ནས་ལམ་ནོར་བའི་སེམས་ཅན་རྣམས་དང་། ལམ་ལོག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པའི་ལམ་བསྟན་ནས་ཡང་དག་པའི་ལམ་ལ་ཡང་དག་པར་རབ་ཏུ་བཀོད་དོ།
en: Maudgalyāyana, for a long time I have constantly taught the genuine path to sentient beings who have lost the way, or entered a mistaken path. By doing so, I have established them on the genuine path.

source: །མཽད་གལ་རྒྱུ་དང་རྐྱེན་དེས་ན་དེ་བཞིན་གཤེགས་པ་ནི་ཡུན་རིང་པོ་ནས་སེམས་ཅན་རྣམས་ལ་ཤིན་དུ་དང་བའི་བསམ་པས་བུ་གཅིག་པ་བརྩེ་ཞིང་ཕངས་པ་ལ་ལྟ་བ་བཞིན་དུ་གཟིགས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Maudgalyāyana, for those reasons, you should know that for a long time the Thus-Gone One has regarded sentient beings with strong affection, perceiving them as a beloved and dear only child.

source: །མཽད་གལ་སྔོན་འདས་པའི་དུས་ན་ཚོང་པ་ཕལ་པོ་ཆེ་ཞིག་མཚན་མོ་ལམ་དུ་ཞུགས་ཏེ་དོང་བ་ལས་ལམ་སྟོར་ནས་ལམ་གོལ་བར་ཞུགས་པ་དང་། མཚན་མོ་མུན་ནག་ཏུ་གྱུར་པའི་ཕྱིར་གར་འགྲོ་བ་མི་ཤེས་ནས་ཐམས་ཅད་ཀྱིས་འདི་སྐད་དུ་བདག་ཅག་ནི་ལམ་སྟོར་ཏེ།
en: “Maudgalyāyana, in the past, a large group of merchants once set out on the path during the night. At some point, they took a wrong turn and lost their way. Because the night was very dark, none of them knew in which direction to proceed, so they started shouting: ‘We are lost!

source: མགོན་བྱེད་པ་ཡང་མེད། སྐྱབས་བྱེད་པ་ཡང་མེད། གནས་བྱེད་པ་ཡང་མེད་ན།
en: We have no protectors, no refuges, and no support.

source: སེམས་ཅན་རྣམས་ལས་སུ་ཞིག་ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། མིའམ། མི་མ་ཡིན་པ་གང་ཞིག་གིས་བདག་ཅག་ལ་ལམ་བསྟན་ནས་ལམ་མ་ནོར་བ་ཐོབ་པར་འགྱུར།
en: Is there anyone—whether god, nāga, yakṣa, human, or nonhuman—who will show us the way, so that we can return to the right path?

source: སུ་ཞིག་བདག་ཅག་ལ་སྙིང་བརྩེ་བས་ཕན་འདོགས་ཤིང་མཚན་མོ་མུན་ནག་ལམ་གོལ་ཞིང་ཉམ་ང་བར་ཞུགས་པ་འདིར་སྣང་བ་སྦྱིན་པར་བྱེད་ཅེས་སྨྲས་སོ།
en: Who will be so kind as to help us and illuminate this wrong and fearsome path in the middle of this dark night?’

source: །མཽད་གལ་དེའི་ཚེ་དགོན་པའི་གནས་ནགས་ཚལ་ཞིག་ན་མུ་སྟེགས་ཅན་གྱི་དྲང་སྲོང་ཞིག་རྩྭའི་སྤྱིལ་བུའི་ནང་ན་འདུག་པ་ལས།
en: “Maudgalyāyana, at that time, a non-Buddhist sage was living in a grass hut in the middle of that isolated forest.

source: མཚན་མོ་མུན་པའི་ནང་ན་ཚོང་པ་མང་པོ་རྣམས་སྙིང་རྗེ་རྗེ་སྐད་དུ་ངུ་འབོད་པའི་སྒྲ་ཐོས་ནས་དེ་འདི་སྙམ་དུ་དེང་ཚོང་པ་མང་པོ་རྣམས་མཚན་མོ་མུན་ནག་ཏུ་གྱུར་པས་དགོན་པའི་གནས་ནགས་ཚལ་འདིར་ལམ་སྟོར་བར་གྱུར་ཏེ། གལ་ཏེ་བདག་གིས་སྐྱབས་མ་བྱས་ན་ཚུལ་ཡང་མ་ཡིན་ལ།
en: Amidst the darkness of the night, he heard the pitiful screams of the merchants and thought, ‘Those merchants are out during this dark night;

source: ཚོང་པ་མང་པོ་རྣམས་ཀྱང་སྟག་གམ།
en: they must have lost their way and strayed into this isolated forest.

source: སེང་གེའམ། སྤྱང་ཀིའམ། གླང་པོ་ཆེའམ། ཝའམ། གཅན་གཟན་མ་རུངས་པ་རྣམས་ཀྱིས་གཙེས་ཤིང་སྲོག་འཕྲོག་པར་འགྱུར་རོ་སྙམ་ནས།
en: If I don’t give them shelter, it would be immoral, and those merchants could be endangered or killed by tigers, lions, wolves, elephants, and jackals, or by other ferocious predators.’

source: མཽད་གལ་དེའི་ཚེ་དྲང་སྲོང་དེས་སྒྲ་ཆེན་པོ་ཕྱུང་སྟེ་ཚོང་པ་རྣམས་ལ་སྨྲས་པ།
en: “Maudgalyāyana, at that moment, the sage shouted loudly to the merchants,

source: ཀྱེ་ཚོང་པ་རྣམས་ཁྱེད་མ་འཇིགས་ཤིག །དེང་བདག་གིས་ཁྱེད་ཀྱི་སྐྱབས་བྱ་ཞིང་སྣང་བས་ཁྱེད་ལ་ལམ་ཡང་དག་པར་བསྟན་པར་བྱའོ་ཞེས་དེའི་ཚེ་དྲང་སྲོང་དེས་ཚོང་པ་རྣམས་ཚིག་གིས་སྤྲོ་བ་བསྐྱེད་དེ།
en: ‘Hey, merchants! Don’t be afraid! I will give you shelter and show you the correct path with my torch.’ When they heard the words of the sage, the merchants were relieved.

source: རས་ཀྱིས་ལག་པ་གཉིས་དཀྲིས་ནས་འབྲུ་མར་གྱིས་ཀུན་དུ་ཁྱབ་པར་བླུགས་ཏེ་མེ་སྤར་ནས་སྒྲོན་མ་བྱས་ཏེ་ཚོང་པ་རྣམས་ལ་ལམ་བསྟན་ཏོ།
en: The sage then wrapped cotton cloth around both his hands, soaked them in oil, and lit them on fire. With these torches, he then showed the path to the merchants.

source: །མཽད་གལ་དེའི་ཚེ་ཚོང་པ་རྣམས་སོ་སོ་ནས་འདི་སྙམ་དུ་དྲང་སྲོང་འདི་ནི་ཤིན་དུ་ངོ་མཚར་ཆེ་བ་ཡིན་ཏེ། བདག་ཅག་གི་ཕྱིར་ལུས་དང་སྲོག་ལ་ཡང་ཕངས་པ་མེད་པར་གྱུར་ཏོ་སྙམ་མོ།
en: “Maudgalyāyana, in that instant, each of the merchants thought, ‘This sage is truly amazing! He is helping us without a care for his own body or life!’

source: །མཽད་གལ་དེའི་ཚེ་དྲང་སྲོང་དེས་ལག་པ་བསྲེགས་པའི་སྣང་བས་ཚོང་པ་རྣམས་ལ་ལམ་བསྟན་ནས་ཀྱང་སེམས་ཅན་ལ་སྙིང་རྗེ་ཆེར་སྐྱེས་པར་གྱུར་ནས་འདི་སྙམ་དུ་ནམ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ་ལམ་ལོག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་སྣང་བ་བྱས་ནས་ཡང་དག་པའི་ལམ་སྟོན་པར་གྱུར་ཅིག་སྙམ་མོ།
en: “Maudgalyāyana, while the sage was showing the path to the merchants with the light from his burning hands, great compassion for sentient beings arose in his mind and he thought, ‘When I awaken to unsurpassed and perfect buddhahood, may I illuminate sentient beings who have embarked on mistaken paths with the light of the Dharma, and may I show them the correct path.’

source: །མཽད་གལ་དེའི་ཚེ་དེའི་དུས་ན་ལག་པ་གཉིས་བསྲེགས་པར་གྱུར་ཀྱང་ལུས་དང་སེམས་ལ་འགྱུར་བ་ཅུང་ཟད་ཀྱང་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Maudgalyāyana, during that time, the body and mind of the sage remained without wavering in the slightest, even though both his hands were on fire. How is this possible?

source: ལྷག་པའི་བསམ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གཞན་གྱི་དོན་ཡོངས་སུ་གཉེར་བ་ན་ལུས་དང་སྲོག་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་པས་སོ།
en: Because bodhisattvas who observe this superior resolve do not cling to their bodies or lives when they pursue the benefit of others.

source: །བསམ་པ་རྣམ་པར་དག་པས་སྦྱིན་པ་ཡོངས་སུ་བཏང་བའི་རྒྱུ་དང་རྐྱེན་གྱིས་དེའི་ལག་པ་ཡང་སྔ་མ་ཁོ་བཞིན་དུ་གྱུར་ཅིང་རྨ་ཡང་མེད་པར་གྱུར་ཏོ།
en: As a consequence of practicing generosity with this pure attitude, the hands of the sage remained unharmed, and he did not suffer from any injury.

source: །ཚོང་པ་རྣམས་ཀྱང་ལམ་རྙེད་པར་གྱུར་ཏེ་ནམ་ནངས་ནས་དྲང་སྲོང་གི་ལག་པ་གཉིས་ལ་རྨ་ཡང་མེད་པར་མཐོང་བ་དང་། ངོ་མཚར་གྱི་བསམ་པ་བསྐྱེད་ནས་འདི་སྙམ་དུ་དྲང་སྲོང་འདི་ནི་རྫུ་འཕྲུལ་གྱི་མཐུ་ཆེན་པོ་དང་ལྡན་པས་མཚན་ཐོག་ཐག་ལག་པ་གཉིས་སྤར་ནས་བདག་ཅག་གི་སྣང་བ་བྱས་ཏེ་ལམ་ཡང་དག་པར་བསྟན་ཀྱང་འདིའི་ལག་པ་ལ་ཚིག་པ་ཅུང་ཟད་ཀྱང་མེད་པས་གདོན་མི་ཟ་བར་འདི་ནི་སྤྱོད་པ་ཆེན་པོ་གྲུབ་ཅིང་ཡོན་ཏན་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ནོ་སྙམ་ནས།
en: The merchants found their way; and at dawn, when they saw that the hands of the sage were unharmed, they became amazed and thought, ‘This sage possesses great, miraculous power. During the whole night, he showed us the way by illuminating our way with his two hands burning, but now there is not even the slightest trace of burns on his hands. He must surely have achieved a high level of conduct and possess great qualities!’

source: མཽད་གལ་དེའི་ཚེ་ཚོང་པ་རྣམས་ཀྱིས་དྲང་སྲོང་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དྲང་སྲོང་ཁྱོད་ཀྱིས་མཆོག་ཏུ་དཀའ་བའི་དཀའ་བ་སྤྱད་པར་གྱུར་པ་ནི་ཤིན་ཏུ་ལེགས་སོ། །དེང་སྤྱོད་པ་འདིས་དངོས་པོ་གང་ཞིག་ཐོབ་པར་སྨོན་ལགས།
en: “Maudgalyāyana, the merchants then said to the sage, ‘The fact that you have endured this extreme hardship is truly excellent! Now, what kind of reward would you like in return for your help?’

source: དྲང་སྲོང་གིས་སྨྲས་པ། ཀྱེ་ཚོང་པ་རྣམས་བདག་ནི་དངོས་པོ་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་ནས་ཁྱེད་ལ་སོགས་པ་འཁོར་བའི་སྡུག་བསྔལ་ལས་བཟླས་ཏེ། ལམ་ལོག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པའི་ལམ་བསྟན་པར་སྨོན་ཏོ།
en: ‘O merchants,’ replied the sage, ‘I wish to attain unsurpassed and perfect awakening, liberate beings like you from their sufferings in saṃsāra, and show the correct path to beings who are following a wrong path.’

source: །དེའི་ཚེ་ཚོང་པ་རྣམས་སེམས་རབ་ཏུ་དགའ་བར་གྱུར་ནས་ཐམས་ཅད་ཀྱིས་འདི་སྐད་དུ་བདག་ཅག་གིས་དངོས་པོ་ཇི་ལྟ་བུ་ཞིག་གིས་དྲང་སྲོང་འདི་ལ་ལན་གླན་པར་བྱ་ཞེས་སྨྲས་པ་དང་། དྲང་སྲོང་གིས་སྨྲས་པ། ཁྱེད་རྣམས་རྩེ་གཅིག་ཏུ་དགེ་བའི་ཆོས་སྤྱོད་ལ་བག་མེད་པར་མ་བྱེད་ཅིག །ཚོང་པ་རྣམས་ཀྱིས་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་འཚལ་ལོ་ཞེས་སྨྲས་ནས་ཚོང་པ་རྣམས་རབ་ཏུ་དགའ་ཞིང་གུས་པས་ཕྱག་བྱས་ཏེ་དེ་ནས་གྱེས་པར་གྱུར་ཏོ།
en: “At that moment, the merchants became utterly delighted and asked, ‘But how may we repay your kindness?’ As an answer, the sage said, ‘Practice virtue one-pointedly, and do not be careless! Merchants, practice in accordance with the teachings!’ Overjoyed, the merchants respectfully paid homage to the sage and dispersed.

source: །མཽད་གལ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་མུ་སྟེགས་ཅན་གྱི་དྲང་སྲོང་ཚོང་པ་རྣམས་ཀྱི་ཆེད་དུ་ལག་པ་སྤར་ནས་ལམ་སྣང་བར་བྱས་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །དེའི་ཚེ་དེའི་དུས་ཀྱི་ཚོང་པ་རྣམས་ནི་ད་ལྟར་གྱི་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་པོ་འདི་དག་ཉིད་ཡིན་ནོ།
en: “Maudgalyāyana, I was the non-Buddhist sage who at that time showed the path to the merchants by setting both his hands on fire. Do not think that this was someone else. The one thousand two hundred monks present today were those merchants.

source: །མཽད་གལ་དེ་བཞིན་གཤེགས་པ་ནི་ཡུན་རིང་པོ་ནས་འཇིགས་ཤིང་སྐྲག་པར་གྱུར་པའི་སེམས་ཅན་རྣམས་ལ་མི་འཇིགས་པ་བྱིན་པ་དང་། ལམ་ལོག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པའི་ལམ་བསྟན་པ་དང་། མིག་མེད་པའི་སེམས་ཅན་དག་ཡོངས་སུ་དག་པའི་མིག་ཐོབ་པར་བྱས་པ་དང་ནད་ཚབས་ཆེ་བའི་སེམས་ཅན་རྣམས་གསོས་ནས་སོས་པར་བྱས་པའི་རྒྱུ་དང་རྐྱེན་དེས་དེ་བཞིན་གཤེགས་པ་ནི་ཡུན་རིང་པོ་ནས་སེམས་ཅན་རྣམས་ལ་ཐུགས་རྗེ་ཆེན་པོ་རབ་ཏུ་མང་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: Maudgalyāyana, for a long time the Thus-Gone One has given fearlessness to sentient beings who experience fear and terror, he has shown the correct path to sentient beings who are following a wrong path, he has helped blind persons to recover flawless vision, and he has healed sentient beings who are afflicted by severe diseases. For those reasons, you should know that for a long time the Thus-Gone One has been extremely compassionate toward sentient beings.
